In [1]:
# Import Libraries 
import pandas as pd

# Lets load the data
Okay, we got our libraries loaded, now it is time to use pandas to read
the train.csv file that is located in the data folder.

Pandas read_csv command is able to read and parse csv files into dataframes, 
you can see the dataframe as a matrix on steroids.

In [4]:
dataset = pd.read_csv('data/train.csv')
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Some Terminology 
In our *dataset* we distinguish between the variables that gives us information that we are going to use 
in the estimation and we call them *features*, the variable we are trying to estimate is called target.

In formal machine learning books, you will often see the dataset expressed as a set $D$ composed of 
$n$ tuples $(\textbf{x},y)$ where $\textbf{x}$ is the feature vector (or predictors) and y is the target variable. 

In this specific problem, **Survived** is the attribute that is our *target* value, all the other attributes from the
dataset are *features*. However we don't need (and in this case we should not) use all the avaliable attributes as features for
our model.

In [7]:
dataset.drop(labels=['Name','Ticket'],
             axis = 1,
             inplace = True)
dataset.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S

In [15]:
# Separate the data into two subsets to see if there is some difference in distr 
# from survived to non survived

survivedSubset = dataset[dataset['Survived'] == 0]
notSurvivedSubset = dataset[dataset['Survived'] == 1]

totalSurvived = len(survivedSubset)
totalNotSurvived = len(notSurvivedSubset)

print(f'Total Survived: {totalSurvived}\nTotal Not Survived: {totalNotSurvived}')
print(f'Ratio NS/S: {totalNotSurvived / totalSurvived :.2f}')

Total Survived: 549
Total Not Survived: 342
Ratio NS/S: 0.62